<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Insert title here</title>
<style>

	#aa{
	position:absolute;
	width:50px;
	height:50px;
	background:grey;
	border:1px solid black;
	left:80px;
	top:50px;
	visibility:visible;
	}
	
	</style>
	
	<script>
		//스크립트로 요소를 변화시킬때는 변화시키는 명령을 function()안에 정의한다.
		//웹페이지내에서 이벤트를 통해 function()을 실행시킨다.
		
		function hide()
		{
			//명령(기능)
			document.getElementById("aa").style.visibility="hidden";
			
		}
		function view()
		{
			document.getElementById("aa").style.visibility="visible";
		}
		function chg()
		{
			document.getElementById("aa").style.background="white";
		}
	</script>

</head>
<body> <!-- css_layer3.jsp -->
	<!-- 
	visibility의 속성을 변화시킴으로 웹에서 보이기, 숨기기 기능을 할 수 있다.
 	-->
 	<div id="aa"> 
 	<input type="button" value="닫기" onclick="hide()">
 	<input type="button" value="클릭" onclick="chg()">
 	</div>
 	<input type="button" value="보이기" onclick="view()">
 
 	
 	학교종이 땡땡땡 어서모이자 오늘은 금요일 하하하!!! 저녁에는 삼결살에 소주한잔!! <p>
 	학교종이 땡땡땡 어서모이자 오늘은 금요일 하하하!!! 저녁에는 삼결살에 소주한잔!! <p>
 	학교종이 땡땡땡 어서모이자 오늘은 금요일 하하하!!! 저녁에는 삼결살에 소주한잔!! <p>
 	학교종이 땡땡땡 어서모이자 오늘은 금요일 하하하!!! 저녁에는 삼결살에 소주한잔!! <p>
 	학교종이 땡땡땡 어서모이자 오늘은 금요일 하하하!!! 저녁에는 삼결살에 소주한잔!! <p>
 	학교종이 땡땡땡 어서모이자 오늘은 금요일 하하하!!! 저녁에는 삼결살에 소주한잔!! <p>
 	학교종이 땡땡땡 어서모이자 오늘은 금요일 하하하!!! 저녁에는 삼결살에 소주한잔!! <p>
 	학교종이 땡땡땡 어서모이자 오늘은 금요일 하하하!!! 저녁에는 삼결살에 소주한잔!! <p>
 	학교종이 땡땡땡 어서모이자 오늘은 금요일 하하하!!! 저녁에는 삼결살에 소주한잔!! <p>
 	학교종이 땡땡땡 어서모이자 오늘은 금요일 하하하!!! 저녁에는 삼결살에 소주한잔!! <p>
 	학교종이 땡땡땡 어서모이자 오늘은 금요일 하하하!!! 저녁에는 삼결살에 소주한잔!! <p>
 	학교종이 땡땡땡 어서모이자 오늘은 금요일 하하하!!! 저녁에는 삼결살에 소주한잔!! <p>
 	학교종이 땡땡땡 어서모이자 오늘은 금요일 하하하!!! 저녁에는 삼결살에 소주한잔!! <p>
 	학교종이 땡땡땡 어서모이자 오늘은 금요일 하하하!!! 저녁에는 삼결살에 소주한잔!! <p>
 	학교종이 땡땡땡 어서모이자 오늘은 금요일 하하하!!! 저녁에는 삼결살에 소주한잔!! <p>
 	학교종이 땡땡땡 어서모이자 오늘은 금요일 하하하!!! 저녁에는 삼결살에 소주한잔!! <p>
 	학교종이 땡땡땡 어서모이자 오늘은 금요일 하하하!!! 저녁에는 삼결살에 소주한잔!! <p>
 	학교종이 땡땡땡 어서모이자 오늘은 금요일 하하하!!! 저녁에는 삼결살에 소주한잔!! <p>
 	학교종이 땡땡땡 어서모이자 오늘은 금요일 하하하!!! 저녁에는 삼결살에 소주한잔!! <p>
 	학교종이 땡땡땡 어서모이자 오늘은 금요일 하하하!!! 저녁에는 삼결살에 소주한잔!! <p>
 	학교종이 땡땡땡 어서모이자 오늘은 금요일 하하하!!! 저녁에는 삼결살에 소주한잔!! <p>
 	학교종이 땡땡땡 어서모이자 오늘은 금요일 하하하!!! 저녁에는 삼결살에 소주한잔!! <p>
 	학교종이 땡땡땡 어서모이자 오늘은 금요일 하하하!!! 저녁에는 삼결살에 소주한잔!! <p>
 	학교종이 땡땡땡 어서모이자 오늘은 금요일 하하하!!! 저녁에는 삼결살에 소주한잔!! <p>
 	학교종이 땡땡땡 어서모이자 오늘은 금요일 하하하!!! 저녁에는 삼결살에 소주한잔!! <p>
 	학교종이 땡땡땡 어서모이자 오늘은 금요일 하하하!!! 저녁에는 삼결살에 소주한잔!! <p>
 	학교종이 땡땡땡 어서모이자 오늘은 금요일 하하하!!! 저녁에는 삼결살에 소주한잔!! <p>
 	학교종이 땡땡땡 어서모이자 오늘은 금요일 하하하!!! 저녁에는 삼결살에 소주한잔!! <p>
 	
</body>
</html>